
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды      
	//Новоятлова ++
	ЭлементКонтактноеЛицо = Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво); 
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;	
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.ДР_КонтактноеЛицо";
	ЭлементКонтактноеЛицо.Заголовок = "Контактное лицо";
	
	ЭлементСкидка = Элементы.Вставить("Скидка", Тип("ПолеФормы"), Элементы.ГруппаСкидок); 
	ЭлементСкидка.Вид = ВидПоляФормы.ПолеВвода;	
	ЭлементСкидка.ПутьКДанным = "Объект.ДР_Скидка";
	ЭлементСкидка.Заголовок = "Согласованная скидка";
	ЭлементСкидка.УстановитьДействие("ПриИзменении", "ДР_ДР_СкидкаПриИзмененииВместо");

	ЭлементРасчитатьСкидку = Элементы.Вставить("РасчитатьСкидку", Тип("КнопкаФормы"), Элементы.ГруппаСкидок); 
	//ЭлементРасчитатьСкидку.Вид = ВидПоляФормы.ПолеВвода;	
	//ЭлементРасчитатьСкидку.ПутьКДанным = "Объект.ДР_РасчитатьСкидку";
	ЭлементРасчитатьСкидку.Заголовок = "Расчитать скидку";
	ЭлементРасчитатьСкидку.ИмяКоманды = "ДР_РасчитатьСкидку";
	//Новоятлова --	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//{{Новоятлова О.А. 15.04.2024 изменение алгоритма
    //ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество; 
	//}}
	ТекущиеДанные.Сумма = (ТекущиеДанные.Цена * ТекущиеДанные.Количество)-(ТекущиеДанные.Цена * ТекущиеДанные.Количество) * (Объект.ДР_Скидка/100);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДР_РасчитатьСкидкуВместоНаСервере()  
	//Новоятлова ++
	Для Каждого Строка Из Объект.Товары Цикл
		 РассчитатьСуммуСтроки(Строка);
		 
	 КонецЦикла;
	 Для Каждого Строка Из Объект.Услуги Цикл
		 РассчитатьСуммуСтроки(Строка);
		 
	КонецЦикла;

	//Новоятлова --	
КонецПроцедуры

&НаКлиенте
Процедура ДР_РасчитатьСкидкуВместо(Команда) 
	//Новоятлова++
	ДР_РасчитатьСкидкуВместоНаСервере();  
	//Новоятлова--
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДР_ДР_СкидкаПриИзмененииВместо(Элемент) 
	//Новоятлова++
	
	Если Объект.Товары.Количество() <> 0 Или Объект.Услуги.Количество() <> 0 Тогда
		
		Ответ = Ждать ВопросАсинх("Пересчитать скидку в документе?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ДР_РасчитатьСкидкуВместоНаСервере()	
			
		КонецЕсли;
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Новоятлова--
КонецПроцедуры


#КонецОбласти

#КонецОбласти
